<a href="https://colab.research.google.com/github/Sateesh110/Rep_ML/blob/master/zFE_Date_Transformations.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Import Packages

In [66]:
import pandas as pd
import numpy as np

#Get Data

In [70]:
# create a series with the ranges
#T-Time frequency, D-Day, M-Month, Y-Year
y = pd.date_range('01.01.2021', periods=12, freq='Y')
print(y)

m = pd.date_range('01.01.2021', periods=12, freq='M')
t = pd.date_range('01.01.2021', periods=12, freq='T')
d = pd.date_range('01.01.2021', periods=12, freq='D')
q = pd.date_range('01.01.2021', periods=12, freq='Q')

DatetimeIndex(['2021-12-31', '2022-12-31', '2023-12-31', '2024-12-31',
               '2025-12-31', '2026-12-31', '2027-12-31', '2028-12-31',
               '2029-12-31', '2030-12-31', '2031-12-31', '2032-12-31'],
              dtype='datetime64[ns]', freq='A-DEC')

In [88]:
df1 = pd.DataFrame({"zDate":y})
df2 = pd.DataFrame({"zDate":m})
df3 = pd.DataFrame({"zDate":t})
df4 = pd.DataFrame({"zDate":d})
df5 = pd.DataFrame({"zDate":q})
lst = [df1,df2,df3,df4,df5]
df = pd.concat(lst)
print(f'# of records :{len(df)}')
print(df.head(3))

# of records :60
       zDate
0 2021-12-31
1 2022-12-31
2 2023-12-31

In [89]:
# attributes & data types
df.dtypes

zDate    datetime64[ns]
dtype: object

#Date Transformations

##Get Date

In [90]:
df['date_part'] = df['zDate'].dt.date
df.head(2)

       zDate   date_part
0 2021-12-31  2021-12-31
1 2022-12-31  2022-12-31

##Extract Day|Month|Year|Quarter|Week|Semister

In [91]:
df["day"]=df['zDate'].dt.day
df["week"]=df['zDate'].dt.weekofyear
df["month"]=df['zDate'].dt.month
df["quarter"]=df['zDate'].dt.quarter
df["year"]=df['zDate'].dt.year
df["time"]=df['zDate'].dt.time
df['day_week'] = df['zDate'].dt.dayofweek
#df['day_week_name'] = df['zDate'].dt.day_week_name
df.head(3)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated.  Please use Series.dt.isocalendar().week instead.

       zDate   date_part  day  week  month  quarter  year      time  day_week
0 2021-12-31  2021-12-31   31    52     12        4  2021  00:00:00         4
1 2022-12-31  2022-12-31   31    52     12        4  2022  00:00:00         5
2 2023-12-31  2023-12-31   31    52     12        4  2023  00:00:00         6

In [92]:
# extract semester
df['semester'] = np.where(df['quarter'].isin([1,2]), 1,2)

df.head(3)

       zDate   date_part  day  week  ...  year      time  day_week semester
0 2021-12-31  2021-12-31   31    52  ...  2021  00:00:00         4        2
1 2022-12-31  2022-12-31   31    52  ...  2022  00:00:00         5        2
2 2023-12-31  2023-12-31   31    52  ...  2023  00:00:00         6        2

[3 rows x 10 columns]

##Convert to Datetime column

In [93]:
df2 = pd.DataFrame({"zDate2":["Jan-2021","Feb-2021","Mar-2021","Apr-2021","May-2021","Jun-2021"]})

# Convert colume to datetime column
df["zDate_New"] = pd.to_datetime(df2["zDate2"])
df.head(3)

       zDate   date_part  day  week  ...      time  day_week  semester  zDate_New
0 2021-12-31  2021-12-31   31    52  ...  00:00:00         4         2 2021-01-01
1 2022-12-31  2022-12-31   31    52  ...  00:00:00         5         2 2021-02-01
2 2023-12-31  2023-12-31   31    52  ...  00:00:00         6         2 2021-03-01

[3 rows x 11 columns]

In [94]:
df.dtypes

zDate        datetime64[ns]
date_part            object
day                   int64
week                  int64
month                 int64
quarter               int64
year                  int64
time                 object
day_week              int64
semester              int64
zDate_New    datetime64[ns]
dtype: object

##Weekend or not?

In [95]:
# is it weekend?
# df['is_weekend'] = np.where(df['day_week_name'].isin(['Sunday', 'Saturday']), 1,0)

df['is_weekend'] = np.where(df['day_week'].isin([6, 0]), 1,0)
df.head()

       zDate   date_part  day  week  ...  day_week  semester  zDate_New is_weekend
0 2021-12-31  2021-12-31   31    52  ...         4         2 2021-01-01          0
1 2022-12-31  2022-12-31   31    52  ...         5         2 2021-02-01          0
2 2023-12-31  2023-12-31   31    52  ...         6         2 2021-03-01          1
3 2024-12-31  2024-12-31   31     1  ...         1         2 2021-04-01          0
4 2025-12-31  2025-12-31   31     1  ...         2         2 2021-05-01          0

[5 rows x 12 columns]

##Extract Hrs|Mins|Sec

In [96]:
rng = pd.date_range('2019-03-05', periods=20, freq='1h15min10s')
df = pd.DataFrame({'date': rng}) 
df.head()

                 date
0 2019-03-05 00:00:00
1 2019-03-05 01:15:10
2 2019-03-05 02:30:20
3 2019-03-05 03:45:30
4 2019-03-05 05:00:40

In [98]:
# extract hr, min and sec

df['hour'] = df['date'].dt.hour
df['min'] = df['date'].dt.minute
df['sec'] = df['date'].dt.second
df.head(3)

                 date  hour  min  sec
0 2019-03-05 00:00:00     0    0    0
1 2019-03-05 01:15:10     1   15   10
2 2019-03-05 02:30:20     2   30   20

In [100]:
# same above logic implemented using a list comperhension 

df[['h','m','s']]= pd.DataFrame([(x.hour,x.minute,x.second) for x in df['date']])
df.head()

                 date  hour  min  sec  h   m   s
0 2019-03-05 00:00:00     0    0    0  0   0   0
1 2019-03-05 01:15:10     1   15   10  1  15  10
2 2019-03-05 02:30:20     2   30   20  2  30  20
3 2019-03-05 03:45:30     3   45   30  3  45  30
4 2019-03-05 05:00:40     5    0   40  5   0  40

In [103]:
# Unique Hrs
df['hour'].unique()

array([ 0,  1,  2,  3,  5,  6,  7,  8, 10, 11, 12, 13, 15, 16, 17, 18, 20,
       21, 22, 23])

##Morning or Evening?

In [107]:
# is it morning?

df['is_morning'] = np.where( (df['hour'] < 7) & (df['hour'] >=0), "Early Office hrs", "No" )

df.head(3)

                 date  hour  min  sec  h   m   s        is_morning
0 2019-03-05 00:00:00     0    0    0  0   0   0  Early Office hrs
1 2019-03-05 01:15:10     1   15   10  1  15  10  Early Office hrs
2 2019-03-05 02:30:20     2   30   20  2  30  20  Early Office hrs

In [112]:
def (df,col):
  if (df[col] < 7) & (df[col] >=0):
    df['OOH'] = "Early Office hrs"
  elif (df[col] < 18) & (df[col] >=0):
    df['OOH'] = "Late Office hrs"
  else:
    df['OOH'] = " "
 return (df)

SyntaxError: ignored